app/Controllers/Alat.php

SELECT *
FROM `alat`
---
    public function index()
    {
        $model = new AlatModel();
        $data = [
            'title' => 'Daftar Alat - Maldin17App',
            'alat'  => $model->findAll()

INSERT INTO `alat` (`nama_alat`, `kategori`, `stok`, `status`, `foto`) VALUES ('wer', 'Elektronik', '100', 'Perbaikan', 'default.jpg')
---
    public function simpan()
    {
        $model = new AlatModel();

        $model->save([
            'nama_alat' => $this->request->getPost('nama_alat'),
            'kategori'  => $this->request->getPost('kategori'),
            'stok'      => $this->request->getPost('stok'),
            'status'    => $this->request->getPost('status'),
            'foto'      => 'default.jpg'
        ]);

SELECT *
FROM `alat`
WHERE `alat`.`id` = '1'
---
    public function edit($id)
    {
        $model = new AlatModel();
        $data = [
            'title' => 'Edit Alat - Maldin17App',
            'alat'  => $model->find($id)