app/Controllers/Kategori.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Kategori',
            'kategori' => $this->kategoriModel->findAll()