app/Controllers/Notifikasi.php

SELECT *
FROM `notifikasi`
WHERE `id_user` = '2'
ORDER BY `created_at` DESC
---
    public function index()
    {
        $id_user = session()->get('id') ?? session()->get('id_user');

        $data = [
            'title' => 'Notifikasi Saya',
            'notif' => $this->db->table('notifikasi')
                ->where('id_user', $id_user)
                ->orderBy('created_at', 'DESC')
                ->get()->getResultArray()

UPDATE `notifikasi` SET `is_read` = 1
WHERE `id` = '3'
---
    public function read($id)
    {
        $this->db->table('notifikasi')->where('id', $id)->update(['is_read' => 1]);