app/Controllers/Peminjaman.php

SELECT *
FROM `alat`
WHERE `alat`.`id` = '1'
INSERT INTO `peminjaman` (`id_alat`, `nama_peminjam`, `tgl_pinjam`, `tgl_kembali`, `jumlah`, `status`) VALUES ('1', 'hehe', '2026-04-11', '2026-04-14', '1', 'pending')
---
    public function proses()
    {
        $id_alat = $this->request->getPost('id_alat');
        $jumlah  = (int) ($this->request->getPost('jumlah') ?: 1);
        $nama    = $this->request->getPost('nama_peminjam');

        $alat = $this->alatModel->find($id_alat);

        if (!$alat || $alat['stok'] <= 0) {
            return redirect()->back()->with('error', 'Maaf, stok alat ini sudah habis.');
        }

        if ($alat['stok'] < $jumlah) {
            return redirect()->back()->with('error', 'Jumlah pinjam melebihi stok yang tersedia.');
        }

        $this->peminjamanModel->save([
            'id_alat'       => $id_alat,
            'nama_peminjam' => $nama,
            'tgl_pinjam'    => $this->request->getPost('tgl_pinjam'),
            'tgl_kembali'   => $this->request->getPost('tgl_kembali'),
            'jumlah'        => $jumlah,
            'status'        => 'pending'
        ]);

SELECT `peminjaman`.*, `alat`.`nama_alat`, `alat`.`kategori`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`id` = '6'
 LIMIT 1
---
    public function detail($id)
    {
        $data['peminjaman'] = $this->peminjamanModel->select('peminjaman.*, alat.nama_alat, alat.kategori')
            ->join('alat', 'alat.id = peminjaman.id_alat')
            ->where('peminjaman.id', $id)
            ->first();