app/Controllers/Peminjaman.php

SELECT *
FROM `alat`
WHERE `stok` > 0
---
    public function index()
    {
        $data = [
            'title' => 'Pilih Alat untuk Dipinjam',
            'alat'  => $this->alatModel->where('stok >', 0)->findAll()
        ];

SELECT *
FROM `alat`
WHERE `alat`.`id` = '3'
---
    public function proses()
    {
        $id_alat = $this->request->getPost('id_alat');
        $jumlah  = (int) ($this->request->getPost('jumlah') ?: 1);
        $nama    = $this->request->getPost('nama_peminjam');

        $alat = $this->alatModel->find($id_alat);

SELECT `peminjaman`.*, `alat`.`nama_alat`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'dipinjam'
SELECT `peminjaman`.*, `alat`.`nama_alat`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'pending'
---
    public function permintaan()
    {
        $data = [
            'title'      => 'Daftar Permintaan Pinjam',
            'peminjaman' => $this->peminjamanModel->select('peminjaman.*, alat.nama_alat')
                ->join('alat', 'alat.id = peminjaman.id_alat')
                ->where('peminjaman.status', 'pending')
                ->findAll()
        ];

SELECT `peminjaman`.*, `alat`.`nama_alat`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`status` = 'dipinjam'
---
    public function pengembalian()
    {
        $data = [
            'title'      => 'Pengembalian Alat',
            'peminjaman' => $this->peminjamanModel->select('peminjaman.*, alat.nama_alat')
                ->join('alat', 'alat.id = peminjaman.id_alat')
                ->where('peminjaman.status', 'dipinjam')
                ->findAll()

SELECT `peminjaman`.*, `alat`.`nama_alat`, `alat`.`kategori`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
ORDER BY `peminjaman`.`id` DESC
---
    public function history()
    {
        $data = [
            'title'      => 'Riwayat Transaksi',
            'peminjaman' => $this->peminjamanModel->select('peminjaman.*, alat.nama_alat, alat.kategori')
                ->join('alat', 'alat.id = peminjaman.id_alat')
                ->orderBy('peminjaman.id', 'DESC')
                ->findAll()

SELECT `peminjaman`.*, `alat`.`nama_alat`, `alat`.`kategori`
FROM `peminjaman`
JOIN `alat` ON `alat`.`id` = `peminjaman`.`id_alat`
WHERE `peminjaman`.`id` = '12'
 LIMIT 1
---
    public function detail($id)
    {
        $data['peminjaman'] = $this->peminjamanModel->select('peminjaman.*, alat.nama_alat, alat.kategori')
            ->join('alat', 'alat.id = peminjaman.id_alat')
            ->where('peminjaman.id', $id)
            ->first();

SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '13'
SELECT *
FROM `alat`
WHERE `alat`.`id` = '1'
DELETE FROM `peminjaman`
WHERE `id` IN ('13')
---
    public function tolak($id)
    {
        $dataPinjam = $this->peminjamanModel->find($id);

        if ($dataPinjam && $dataPinjam['status'] == 'pending') {
            $alat = $this->alatModel->find($dataPinjam['id_alat']);

            // NOTIF UNTUK USER: Bahwa pinjaman ditolak
            if (!empty($dataPinjam['id_user'])) {
                $this->simpanNotif($dataPinjam['id_user'], "Maaf, permintaan pinjam " . ($alat['nama_alat'] ?? 'alat') . " DITOLAK.");
            }

            $this->peminjamanModel->delete($id);