app/Controllers/Peminjaman.php

SELECT *
FROM `alat`
WHERE `status` = 'Tersedia'
---
    public function index()
    {
        $data = [
            'title' => 'Peminjaman Alat',
            'alat'  => $this->alatModel->where('status', 'Tersedia')->findAll()