app/Controllers/Users.php

    public function index()
    {
        // Proteksi dihapus agar semua role bisa melihat daftar user
        $data = [
            'title' => 'Daftar User',
            'users' => $this->users->findAll()
---
SELECT *
FROM `users`